---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.IPointCloudAccess.GetName
source: html/896650d1-884d-0b9a-d78d-42f36cc2633b.htm
---
# Autodesk.Revit.DB.PointClouds.IPointCloudAccess.GetName Method

Implement this method to return the name of the point cloud that will be used when Revit needs to
 refer to the point cloud type, e.g. in the Manage Links dialog or in the
 Type Properties dialog.

## Syntax (C#)
```csharp
string GetName()
```

## Returns
The name of the point cloud for Revit's user interface.